
#โปรแกรมตรวจสอบน้ำหนักรถบรรทุกของด่านชั่งน้ำหนัก 
#ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ หากน้ำหนักเกิน 1000 kg 
#ลงมาให้แสดงข้อความว่า "รถน้ำหนักไม่ผ่านเกณฑ์" แต่หากน้ำหนักตั้งแต่ 1000 kg 
#ลงมาให้แสดงข้อความว่า "รถน้ำหนักผ่านเกณฑ์" โดยให้ป้อนทะเบียนรถบรรทุก
#และน้ำหนักรถบรรทุกทางแป้นพิมพ์

#วิเคราะห์
#มองหา feature การทำงานว่ามีอะไรบ้าง เพื่อจะไปสร้างเป็น function 
#รับค่าทะเบียนรถ น้ำหนักรถ

def inputCarDetail() :
    CarNo = input("ป้อนทะเบียนรถ : ")
    CarWeight = float(input("ป้อนน้ำหนักรถ : "))
    return CarNo, CarWeight

def checkCarAndShoeWeight(carNo, carweight) :
    if carweight > 1000 :
        print(f'ทะเบียนรถ {carNo} น้ำหนักไม่ผ่านเกณฑ์')
    else :
        print(f"ทะเบียนรถ {carNo} น้ำหนักผ่านเกณฑ์")

print("................................")
print("***--* Truck Checker *--***")
print("................................")
carNo, carweight = inputCarDetail()
print("................................")
checkCarAndShoeWeight(carNo, carweight)
print("................................")